{

  let myMap;

  const mapDelivery = document.querySelector('#map-delivery');

  if (mapDelivery) {

    ymaps.ready(init);

    function init () {
      myMap = new ymaps.Map('map-delivery', {

        center: [55.77567297366562,37.616599835937514],
        zoom: 5,
        controls: []
      });


      var myGeoObject = new ymaps.GeoObject({
        // Описываем геометрию геообъекта.
        geometry: {
          // Тип геометрии - "Многоугольник".
          type: "Polygon",
          // Указываем координаты вершин многоугольника.
          coordinates: [
            // Координаты вершин внешнего контура.
            [[58.90106587919162,50.59202518749981],
              [62.30425365644154,34.39714756249991],
              [61.419288495402085,25.254462624999952],
              [58.3139648375561,23.93404331249995],
              [56.06829508097347,28.657649421874922],
              [54.046752005928525,28.679107093749906],
              [52.637767811218026,31.458390617187398],
              [51.29200291865248,33.09509601562492],
              [50.481450658306365,34.215186499999916],
              [49.88218060774752,36.80864660241689],
              [49.160187972696114,38.9626535798339],
              [48.39125152042711,45.292151909667886],
              [50.596317656485226,47.755836069335814],
              [48.424967397462325,51.62851688867174],
              [51.81210613026443,55.686352618906554],
              [54.14341697177243,55.11942234374991],
              [58.90106587919162,50.59202518749981]]

          ],
          // Задаем правило заливки внутренних контуров по алгоритму "nonZero".
          fillRule: "nonZero"
        },
        // Описываем свойства геообъекта.
        properties:{
          // Содержимое балуна.
          balloonContent: "География поставок"
        }
      }, {
        // Описываем опции геообъекта.
        // Цвет заливки.
        fillColor: '#2CE3FF',
        // Цвет обводки.
        strokeColor: '#24C2DB',
        // Общая прозрачность (как для заливки, так и для обводки).
        opacity: 0.3,
        // Ширина обводки.
        strokeWidth: 2,
        // Стиль обводки.
        strokeStyle: 'solid'
      });

      // Добавляем многоугольник на карту.
      myMap.geoObjects.add(myGeoObject);
    }


  }




}
